constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver volumetricBSplinesMotionSolver;

volumetricBSplinesMotionSolverCoeffs
{
    duct
    {
        type    cartesian;
        nCPsU   50;
        nCPsV   20;
        nCPsW   3;
        degreeU 4;
        degreeV 4;
        degreeW 2;

        controlPointsDefinition axisAligned;
      lowerCpBounds           ( -5 -2  -0.1);
       upperCpBounds           ( 6  2   1.1);

        confineUMovement false;
        confineVMovement false;
        confineWMovement true;
        confineBoundaryControlPoints true;

        confineUMinCPs ();// (true true true) (true true true) );
        confineUMaxCPs ();// (true true true) (true true true) );
        confineVMinCPs ();// (true true true) );
        confineVMaxCPs ();// (true true true) );
        confineWMinCPs ();//  (true true true) );
        confineWMaxCPs ();//  (true true true) );
    }
}

// ************************************************************************* //
