0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 2.04e-04;

boundaryField
{
    frontBack
    {
        type            empty;
    }
    suction
    {
        type            fixedValue;
        value           uniform 0;
    }
    pressure
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 2.04e-04;
        value           uniform 2.04e-04;
    }
}

// ************************************************************************* //
