0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 5.10e-05;

boundaryField
{
    frontBack
    {
        type            empty;
    }
    suction
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    pressure
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 5.10e-05;
    }
}


// ************************************************************************* //
