system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

SIMPLE
{
    nNonOrthogonalCorrectors 2;
}

solvers
{
    "p.*|pa.*"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-9;
        relTol           1e-3;
    };
    "m|ma"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-9;
        relTol          1e-3;
    };
    "U.*|Ua.*|nuTilda.*|nuaTilda.*|yWall|da"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-9;
        relTol           1e-3;
    }
}

relaxationFactors
{
    fields
    {
        "p.*"        0.3;
        "pa.*"       0.7;
    }
    equations
    {
        "U.*"        0.7;
        "Ua.*"       0.3;
        "nuTilda.*"  0.7;
        "nuaTilda.*" 0.1;
        "yWall.*"    0.5;
        "da.*"       0.7;
    }
}


// ************************************************************************* //
