system/optimisationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      optimisationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

optimisationManager     steadyOptimisation;

primalSolvers
{
    op1
    {
        active                 true;
        type                   incompressible;
        solver                 simple;
        useSolverNameForFields false;
        solutionControls
        {
            nIters 10;
            residualControl
            {
                "p.*"       1.e-7;
                "U.*"       1.e-7;
                "nuTilda.*" 1.e-6;
            }
        }
    }
}

adjointManagers
{
    adjManager1
    {
        primalSolver             op1;
        operatingPointWeight     1;
        adjointSolvers
        {
            adjS1
            {
                // choose adjoint solver
                //----------------------
                active                true;
                type                   incompressible;
                solver                 adjointSimple;
                useSolverNameForFields true;
                computeSensitivities   true;

                // manage objectives
                //------------------
                objectives
                {
                    type                incompressible;
                    objectiveNames
                    {
                        lift
                        {
                            weight          1.;
                            type            force;
                            patches         (pressure suction);
                            direction       (0.0348994 -0.99939 0);
                            Aref            1;
                            rhoInf          1.18;
                            UInf            51;
                        }
                    }
                }

                // ATC treatment
                //--------------
                ATCModel
                {
                    ATCModel          standard;
                    extraConvection   0;
                    nSmooth           0;
                    zeroATCPatchTypes ();
                    maskType          faceCells;
                }

                // solution control
                //------------------
                solutionControls
                {
                    nIters 10;
                    residualControl
                    {
                        "pa.*"       1.e-7;
                        "Ua.*"       1.e-7;
                        "nuaTilda.*" 1.e-7;
                    }
                }
            }
	
	adj2
            {
                // choose adjoint solver
                //----------------------
                active                true;
                type                   incompressible;
                solver                 adjointSimple;
                useSolverNameForFields true;
                computeSensitivities   true;
                isConstraint           true;

                // manage objectives
                //------------------
                objectives
                {
                    type                incompressible;
                    objectiveNames
                    {
                        drag
                        {
                            weight          1.;
                            type            forceTarget;
                            patches         (pressure suction);
                            direction       (0.99939  0.0348994 0);
                            Aref            1;
                            rhoInf          1.18;
                            UInf            51;
                            target         0.0133515;
                        }
                    }
                }

                // ATC treatment
                //--------------
                ATCModel
                {
                    ATCModel          standard;
                    extraConvection   0;
                    nSmooth           0;
                    zeroATCPatchTypes ();
                    maskType          faceCells;
                }

                // solution control
                //------------------
                solutionControls
                {
                    nIters 10;
                    residualControl
                    {
                        "pa.*"       1.e-7;
                        "Ua.*"       1.e-7;
                        "nuaTilda.*" 1.e-7;
                    }
                }
            }
	
		vol
            {
                // choose adjoint solver
                //----------------------
                active                 true;
                type                   incompressible;
                solver                 adjointSimple;
                useSolverNameForFields true;
                isConstraint           true;

                // manage objectives
                //------------------
                objectives
                {
                    type                incompressible;
                    objectiveNames
                    {
                        vol
                        {
                            weight          1;
                            type            partialThickness;
                            patches         (suction);
                        }
                    }
                }

                // ATC treatment
                //--------------
                ATCModel
                {
                    ATCModel        standard;
                }

                // solution control
                //------------------
                solutionControls
                {
                    nIters 10;
                    residualControl
                    {
                        "pa.*"       1.e-7;
                        "Ua.*"       1.e-7;
                    }
                }
            }

		
        }
    }
}


optimisation
{
optimisationType
    {
        type            shapeOptimisation;
        writeEachMesh   true;
    }
    sensitivities
    {
        type            multiple; // used to compute many kinds of sensitivities at the same time
        patches         (pressure suction);
        sensTypes
		{
			Surface_Points 
			{
					type              surfacePoints;
					patches           (pressure suction);
					includeSurfaceArea  false;
					includeDistance     true;
					includeMeshMovement true;
					includeObjectiveContribution true;
					writeAllSurfaceFiles         true;
					adjointMeshMovementSolver
				{
					iters     1000;
					tolerance 1.e-6;
				}
				adjointEikonalSolver
				{
					iters     1000;
					tolerance 1.e-6;
					epsilon   0.1;
				}
			}
			Vol_B_Spline
			    {
				type            volumetricBSplinesFI;
				patches         (pressure suction);
				includeSurfaceArea  false;
				includeDistance     true;
				includeMeshMovement true;
				includeObjectiveContribution true;
				writeAllSurfaceFiles         true;
				adjointMeshMovementSolver
				{
					iters     1000;
					tolerance 1.e-6;
				}
				adjointEikonalSolver
				{
					iters     1000;
					tolerance 1.e-6;
					epsilon   0.1;
				}
			    }
						
			
		}
    }
updateMethod
    {
        method          constraintProjection;
	lineSearch
        {
            type    ArmijoConditions;
        }
	
	
    }
    meshMovement
    {
        type            volumetricBSplines;
        maxAllowedDisplacement 1.e-2;
    }
}

// ************************************************************************* //
